---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.DialogBoxData
source: html/6a8b3bf2-2220-ed48-37fa-6e47d20bb9ce.htm
---
# DialogBoxData Members

Causes the object to release immediately any resources it may be utilizing.